// Напишите прогу которая берет две точки, а на выходу получаем растояние в 3Д

Console.WriteLine();
int x1
int y1
int z1
int x2
int y2
int z2